SET NAMES UTF8;
DROP DATABASE IF EXISTS xbk;
CREATE DATABASE xbk CHARSET=UTF8;
USE xbk;

/**星巴克产品分类表**/
CREATE TABLE xbk_category(
  cid INT PRIMARY KEY AUTO_INCREMENT,
  cname VARCHAR(32)
);

/**星巴克产品表**/
CREATE TABLE xbk_product(
  pid INT PRIMARY KEY AUTO_INCREMENT,
  fid TINYINT(4),
  pename VARCHAR(32),  
  pname VARCHAR(32),
  detail  VARCHAR(64),
  price  DECIMAL(10,2),
  pic VARCHAR(128),
  size VARCHAR(32),
  intro VARCHAR(128)
);
/**星巴克产品规格，适合人群表**/
CREATE TABLE xbk_product_detail(
  did INT PRIMARY KEY AUTO_INCREMENT,
  pid INT,
  price DECIMAL(10,2),
  detail VARCHAR(128),
  dsize VARCHAR(128)
);
/**会员讨论区**/
CREATE TABLE xbk_discuss(
  tid INT PRIMARY KEY AUTO_INCREMENT,
  title VARCHAR(32),
  ttime VARCHAR(32),
  pic VARCHAR(64)
);

/**用户信息**/
CREATE TABLE xbk_user(
  uid INT PRIMARY KEY AUTO_INCREMENT,
  uname VARCHAR(32),
  upwd VARCHAR(32),
  phone VARCHAR(16)
);

/**购物车条目**/
CREATE TABLE xbk_shoppingcart_item(
  iid INT PRIMARY KEY AUTO_INCREMENT,
  user_id INT,      #用户编号
  product_id INT,   #商品编号
  count INT,        #购买数量
  checked INT #是否已勾选，确定购买
);

/**首页条目**/
CREATE TABLE xbk_main_banner(
  bid INT PRIMARY KEY AUTO_INCREMENT,
  pic VARCHAR(32),
  href  VARCHAR(32)
);
CREATE TABLE xbk_main_index(
  iid INT PRIMARY KEY AUTO_INCREMENT,
  pic VARCHAR(32),
  title  VARCHAR(32)
);
CREATE TABLE xbk_main_top(
  tid INT PRIMARY KEY AUTO_INCREMENT,
  pic VARCHAR(32),
  href VARCHAR(32)
);

/*******************/
/******数据导入******/
/*******************/
/*****************星巴克产品分类表插入数据***************************/
INSERT INTO  xbk_category VALUES
(NULL,"咖啡"),
(NULL,"蛋糕"),
(NULL,"小食"),
(NULL,"冰激凌");

INSERT INTO  xbk_main_banner VALUES
(NULL,'banner1.jpg',''),
(NULL,'banner2.jpg','');

INSERT INTO  xbk_main_index VALUES
(NULL,'index1.png',"咖啡"),
(NULL,'index2.png',"蛋糕"),
(NULL,'index3.png',"冰激凌"),
(NULL,'index4.png',"小食");

INSERT INTO  xbk_main_top VALUES
(NULL,'top1.png',""),
(NULL,'top2.png',""),
(NULL,'top3.png',""),
(NULL,'top4.png',"");




INSERT INTO  xbk_user VALUES
(NULL,'su','123456','15757124870');

INSERT INTO  xbk_product VALUES
(NULL,1,'GRTL','冰抹茶拿铁','','34','xbk1.jpg','中杯',"不使用罐头水果和植混奶油，坚持应季凯鲜切芒果"),
(NULL,1,'V.FW','冰香草馥芮白','','34','xbk2.jpg','中杯',"不使用罐头水果和植混奶油，坚持应季凯鲜切芒果"),
(NULL,1,'CL','热焦糖拿铁','','34','xbk3.jpg','中杯',"不使用罐头水果和植混奶油，坚持应季凯鲜切芒果"),
(NULL,1,'CBIC','冷萃冰咖啡','','34','xbk4.jpg','中杯',"不使用罐头水果和植混奶油，坚持应季凯鲜切芒果"),
(NULL,1,'VSCCB','清甜香草风味奶油冷萃冰咖啡','','34','xbk5.jpg','中杯',"不使用罐头水果和植混奶油，坚持应季凯鲜切芒果"),
(NULL,1,'HL','热榛果拿铁','','34','xbk6.jpg','中杯',"不使用罐头水果和植混奶油，坚持应季凯鲜切芒果"),
(NULL,1,'CM','热焦糖玛奇朵','','34','xbk7.jpg','中杯',"不使用罐头水果和植混奶油，坚持应季凯鲜切芒果"),
(NULL,1,'HMF','榛果风味摩卡星冰乐','','34','xbk8.jpg','中杯',"不使用罐头水果和植混奶油，坚持应季凯鲜切芒果"),
(NULL,1,'CEF','焦糖浓缩咖啡星冰乐','','34','xbk9.jpg','中杯',"不使用罐头水果和植混奶油，坚持应季凯鲜切芒果"),
(NULL,1,'V/CRM','香草星冰乐','','34','xbk10.jpg','中杯',"不使用罐头水果和植混奶油，坚持应季凯鲜切芒果"),
(NULL,1,'MO.CRM','巧克力星冰乐','','34','xbk11.jpg','中杯',"不使用罐头水果和植混奶油，坚持应季凯鲜切芒果"),
(NULL,1,'S.GT.CRM','抹茶豆奶星冰乐','','34','xbk12.jpg','中杯',"不使用罐头水果和植混奶油，坚持应季凯鲜切芒果"),
(NULL,1,'FC.MF','摩卡可可碎片星冰乐','','34','xbk13.jpg','中杯',"不使用罐头水果和植混奶油，坚持应季凯鲜切芒果"),
(NULL,1,'MF','摩卡星冰乐','','34','xbk14.jpg','中杯',"不使用罐头水果和植混奶油，坚持应季凯鲜切芒果"),
(NULL,4,'Liliane ~ Gâteau glacée','恋恋·草莓冰淇淋蛋糕','','34','b1.jpg','',"不使用罐头水果和植混奶油，坚持应季凯鲜切芒果"),
(NULL,4,'Choco ~ Mariage','浓巧·迷情冰淇淋蛋糕','','34','b2.jpg','',"不使用罐头水果和植混奶油，坚持应季凯鲜切芒果"),
(NULL,4,'Luke et dondon','卢克和咚咚冰淇淋蛋糕','','34','b3.jpg','',"不使用罐头水果和植混奶油，坚持应季凯鲜切芒果"),
(NULL,2,'La pupille de Dracula','德古拉之瞳','','34','1.jpg','2.0磅',"不使用罐头水果和植混奶油，坚持应季凯鲜切芒果"),
(NULL,2,' Blanche gamine','布兰奇卡曼','','34','2.jpg','2.0磅',"不使用罐头水果和植混奶油，坚持应季凯鲜切芒果"),
(NULL,2,'Mont Blanc','朗姆醇栗','','34','3.jpg','2.0磅',"不使用罐头水果和植混奶油，坚持应季凯鲜切芒果"),
(NULL,2,'lapin détendu','安逸兔','','34','4.jpg','2.0磅',"不使用罐头水果和植混奶油，坚持应季凯鲜切芒果"),
(NULL,2,' Napoléon aux myrtilles','蓝莓轻乳拿破仑','','34','5.jpg','2.0磅',"不使用罐头水果和植混奶油，坚持应季凯鲜切芒果"),
(NULL,2,'Napoléon 1893','拿破仑1893','','34','6.jpg','2.0磅',"不使用罐头水果和植混奶油，坚持应季凯鲜切芒果"),
(NULL,2,' Napoléon vanille','经典香草拿破仑','','34','7.jpg','2.0磅',"不使用罐头水果和植混奶油，坚持应季凯鲜切芒果"),
(NULL,2,'La Forêt noir','黑森林拿破仑','','34','8.jpg','2.0磅',"不使用罐头水果和植混奶油，坚持应季凯鲜切芒果"),
(NULL,2,'Liliane ~ Gâteau glacée','恋恋·草莓冰淇淋蛋糕','','34','9.jpg','2.0磅',"不使用罐头水果和植混奶油，坚持应季凯鲜切芒果"),
(NULL,2,'Choco ~ Mariage','浓巧·迷情冰淇淋蛋糕','','34','10.jpg','2.0磅',"不使用罐头水果和植混奶油，坚持应季凯鲜切芒果"),
(NULL,2,'Luke et dondon','卢克和咚咚冰淇淋蛋糕','','34','11.jpg','2.0磅',"不使用罐头水果和植混奶油，坚持应季凯鲜切芒果"),
(NULL,2,'Carré Blanc','简','','34','12.jpg','2.0磅',"不使用罐头水果和植混奶油，坚持应季凯鲜切芒果"),
(NULL,2,'Jardin d Alice','爱丽丝花境','','34','13.jpg','2.0磅',"不使用罐头水果和植混奶油，坚持应季凯鲜切芒果"),
(NULL,2,' Nino','尼诺','','34','14.jpg','2.0磅',"不使用罐头水果和植混奶油，坚持应季凯鲜切芒果"),
(NULL,2,'Ricotta','瑞可塔厚爱','','34','15.jpg','2.0磅',"不使用罐头水果和植混奶油，坚持应季凯鲜切芒果"),
(NULL,2,'Fromage Velouté','香溢新芝','','34','16.jpg','2.0磅',"不使用罐头水果和植混奶油，坚持应季凯鲜切芒果"),
(NULL,2,' Velour rouge','蔓越莓红丝绒','','34','17.jpg','2.0磅',"不使用罐头水果和植混奶油，坚持应季凯鲜切芒果"),
(NULL,2,'Fraise-Chantilly','鲜莓印雪','','34','18.jpg','2.0磅',"不使用罐头水果和植混奶油，坚持应季凯鲜切芒果"),
(NULL,2,'bonbon','棒棒糖','','34','19.jpg','2.0磅',"不使用罐头水果和植混奶油，坚持应季凯鲜切芒果"),
(NULL,2,'Pink RosettePink','•罗赛特','','34','20.jpg','2.0磅',"不使用罐头水果和植混奶油，坚持应季凯鲜切芒果"),
(NULL,2,'Sablé parfait','沙布蕾芭菲','','34','21.jpg','2.0磅',"不使用罐头水果和植混奶油，坚持应季凯鲜切芒果"),
(NULL,2,'Le MOJITOMojito ','柠•漾','','34','22.jpg','2.0磅',"不使用罐头水果和植混奶油，坚持应季凯鲜切芒果"),
(NULL,2,'Genoise café','卡法香缇','','34','23.jpg','2.0磅',"不使用罐头水果和植混奶油，坚持应季凯鲜切芒果"),
(NULL,2,'Gâteau de crêpes','法香奶油可丽','','34','24.jpg','2.0磅',"不使用罐头水果和植混奶油，坚持应季凯鲜切芒果"),
(NULL,3,'Biscuit aux cheeses','芝士小生','','34','x1.jpg','',"不使用罐头水果和植混奶油，坚持应季凯鲜切芒果"),
(NULL,3,'cheese cake','半熟芝士','','34','x1.jpg','',"不使用罐头水果和植混奶油，坚持应季凯鲜切芒果"),
(NULL,3,' M chocolatV.S.O.P','生巧','','34','x2.jpg','',"不使用罐头水果和植混奶油，坚持应季凯鲜切芒果"),
(NULL,3,'1/4 chocolat au lait1/4','牛奶生巧','','34','x3.jpg','',"不使用罐头水果和植混奶油，坚持应季凯鲜切芒果"),
(NULL,3,'Chocolats mixtes','生巧组合','','34','x4.jpg','',"不使用罐头水果和植混奶油，坚持应季凯鲜切芒果"),
(NULL,3,'Cookies aux craneberry','塔尼小红莓','','34','x5.jpg','',"不使用罐头水果和植混奶油，坚持应季凯鲜切芒果"),
(NULL,3,'cookies au beurre（original）','云顶小花（原味）','','34','x6.jpg','',"不使用罐头水果和植混奶油，坚持应季凯鲜切芒果"),
(NULL,3,'cookies au beurre（Motcha）','云顶小花（抹茶味）','','34','x7.jpg','',"不使用罐头水果和植混奶油，坚持应季凯鲜切芒果"),
(NULL,3,'cookies au beurre（Chocolat）','云顶小花（巧克力味）','','34','x8.jpg','',"不使用罐头水果和植混奶油，坚持应季凯鲜切芒果");

/**星巴克产品规格，适合人群表**/
INSERT INTO xbk_product_detail VALUES
(NULL,18,198,'12x12cm/适合3-4人分享/含5套餐具/需提前5小时预定','1.0磅'),
(NULL,18,258,'15x15cm/适合4-5人分享/含5套餐具/需提前5小时预定','1.5磅'),
(NULL,18,298,'16x16cm/适合7-8人分享/含10套餐具/需提前5小时预定','2.0磅'),
(NULL,18,458,'22x22cm/适合3-4人分享/含15套餐具/需提前5小时预定','3.0磅'),
(NULL,18,558,'27x27cm/适合15-20人分享/含20套餐具/需提前5小时预定','5.0磅'),
(NULL,19,198,'12x12cm/适合3-4人分享/含5套餐具/需提前5小时预定','1.0磅'),
(NULL,19,258,'15x15cm/适合4-5人分享/含5套餐具/需提前5小时预定','1.5磅'),
(NULL,19,298,'16x16cm/适合7-8人分享/含10套餐具/需提前5小时预定','2.0磅'),
(NULL,19,458,'22x22cm/适合3-4人分享/含15套餐具/需提前5小时预定','3.0磅'),
(NULL,19,558,'27x27cm/适合15-20人分享/含20套餐具/需提前5小时预定','5.0磅'),
(NULL,20,198,'12x12cm/适合3-4人分享/含5套餐具/需提前5小时预定','1.0磅'),
(NULL,20,258,'15x15cm/适合4-5人分享/含5套餐具/需提前5小时预定','1.5磅'),
(NULL,20,298,'16x16cm/适合7-8人分享/含10套餐具/需提前5小时预定','2.0磅'),
(NULL,20,458,'22x22cm/适合3-4人分享/含15套餐具/需提前5小时预定','3.0磅'),
(NULL,20,558,'27x27cm/适合15-20人分享/含20套餐具/需提前5小时预定','5.0磅'),
(NULL,21,198,'12x12cm/适合3-4人分享/含5套餐具/需提前5小时预定','1.0磅'),
(NULL,21,258,'15x15cm/适合4-5人分享/含5套餐具/需提前5小时预定','1.5磅'),
(NULL,21,298,'16x16cm/适合7-8人分享/含10套餐具/需提前5小时预定','2.0磅'),
(NULL,21,458,'22x22cm/适合3-4人分享/含15套餐具/需提前5小时预定','3.0磅'),
(NULL,21,558,'27x27cm/适合15-20人分享/含20套餐具/需提前5小时预定','5.0磅'),
(NULL,22,198,'12x12cm/适合3-4人分享/含5套餐具/需提前5小时预定','1.0磅'),
(NULL,22,258,'15x15cm/适合4-5人分享/含5套餐具/需提前5小时预定','1.5磅'),
(NULL,22,298,'16x16cm/适合7-8人分享/含10套餐具/需提前5小时预定','2.0磅'),
(NULL,22,458,'22x22cm/适合3-4人分享/含15套餐具/需提前5小时预定','3.0磅'),
(NULL,23,558,'27x27cm/适合15-20人分享/含20套餐具/需提前5小时预定','5.0磅'),
(NULL,23,198,'12x12cm/适合3-4人分享/含5套餐具/需提前5小时预定','1.0磅'),
(NULL,23,258,'15x15cm/适合4-5人分享/含5套餐具/需提前5小时预定','1.5磅'),
(NULL,23,298,'16x16cm/适合7-8人分享/含10套餐具/需提前5小时预定','2.0磅'),
(NULL,24,458,'22x22cm/适合3-4人分享/含15套餐具/需提前5小时预定','3.0磅'),
(NULL,24,558,'27x27cm/适合15-20人分享/含20套餐具/需提前5小时预定','5.0磅'),
(NULL,24,198,'12x12cm/适合3-4人分享/含5套餐具/需提前5小时预定','1.0磅'),
(NULL,24,258,'15x15cm/适合4-5人分享/含5套餐具/需提前5小时预定','1.5磅'),
(NULL,25,298,'16x16cm/适合7-8人分享/含10套餐具/需提前5小时预定','2.0磅'),
(NULL,25,458,'22x22cm/适合3-4人分享/含15套餐具/需提前5小时预定','3.0磅'),
(NULL,25,558,'27x27cm/适合15-20人分享/含20套餐具/需提前5小时预定','5.0磅'),
(NULL,25,198,'12x12cm/适合3-4人分享/含5套餐具/需提前5小时预定','1.0磅'),
(NULL,26,258,'15x15cm/适合4-5人分享/含5套餐具/需提前5小时预定','1.5磅'),
(NULL,26,298,'16x16cm/适合7-8人分享/含10套餐具/需提前5小时预定','2.0磅'),
(NULL,26,458,'22x22cm/适合3-4人分享/含15套餐具/需提前5小时预定','3.0磅'),
(NULL,26,558,'27x27cm/适合15-20人分享/含20套餐具/需提前5小时预定','5.0磅'),
(NULL,27,198,'12x12cm/适合3-4人分享/含5套餐具/需提前5小时预定','1.0磅'),
(NULL,27,258,'15x15cm/适合4-5人分享/含5套餐具/需提前5小时预定','1.5磅'),
(NULL,27,298,'16x16cm/适合7-8人分享/含10套餐具/需提前5小时预定','2.0磅'),
(NULL,27,458,'22x22cm/适合3-4人分享/含15套餐具/需提前5小时预定','3.0磅'),
(NULL,27,558,'27x27cm/适合15-20人分享/含20套餐具/需提前5小时预定','5.0磅'),
(NULL,28,198,'12x12cm/适合3-4人分享/含5套餐具/需提前5小时预定','1.0磅'),
(NULL,28,258,'15x15cm/适合4-5人分享/含5套餐具/需提前5小时预定','1.5磅'),
(NULL,28,298,'16x16cm/适合7-8人分享/含10套餐具/需提前5小时预定','2.0磅'),
(NULL,28,458,'22x22cm/适合3-4人分享/含15套餐具/需提前5小时预定','3.0磅'),
(NULL,28,558,'27x27cm/适合15-20人分享/含20套餐具/需提前5小时预定','5.0磅'),
(NULL,29,198,'12x12cm/适合3-4人分享/含5套餐具/需提前5小时预定','1.0磅'),
(NULL,29,258,'15x15cm/适合4-5人分享/含5套餐具/需提前5小时预定','1.5磅'),
(NULL,29,298,'16x16cm/适合7-8人分享/含10套餐具/需提前5小时预定','2.0磅'),
(NULL,29,458,'22x22cm/适合3-4人分享/含15套餐具/需提前5小时预定','3.0磅'),
(NULL,29,558,'27x27cm/适合15-20人分享/含20套餐具/需提前5小时预定','5.0磅'),
(NULL,30,198,'12x12cm/适合3-4人分享/含5套餐具/需提前5小时预定','1.0磅'),
(NULL,30,258,'15x15cm/适合4-5人分享/含5套餐具/需提前5小时预定','1.5磅'),
(NULL,30,298,'16x16cm/适合7-8人分享/含10套餐具/需提前5小时预定','2.0磅'),
(NULL,30,458,'22x22cm/适合3-4人分享/含15套餐具/需提前5小时预定','3.0磅'),
(NULL,30,558,'27x27cm/适合15-20人分享/含20套餐具/需提前5小时预定','5.0磅'),
(NULL,31,198,'12x12cm/适合3-4人分享/含5套餐具/需提前5小时预定','1.0磅'),
(NULL,31,258,'15x15cm/适合4-5人分享/含5套餐具/需提前5小时预定','1.5磅'),
(NULL,31,298,'16x16cm/适合7-8人分享/含10套餐具/需提前5小时预定','2.0磅'),
(NULL,31,458,'22x22cm/适合3-4人分享/含15套餐具/需提前5小时预定','3.0磅'),
(NULL,31,558,'27x27cm/适合15-20人分享/含20套餐具/需提前5小时预定','5.0磅'),
(NULL,32,198,'12x12cm/适合3-4人分享/含5套餐具/需提前5小时预定','1.0磅'),
(NULL,32,258,'15x15cm/适合4-5人分享/含5套餐具/需提前5小时预定','1.5磅'),
(NULL,32,298,'16x16cm/适合7-8人分享/含10套餐具/需提前5小时预定','2.0磅'),
(NULL,32,458,'22x22cm/适合3-4人分享/含15套餐具/需提前5小时预定','3.0磅'),
(NULL,32,558,'27x27cm/适合15-20人分享/含20套餐具/需提前5小时预定','5.0磅'),
(NULL,33,198,'12x12cm/适合3-4人分享/含5套餐具/需提前5小时预定','1.0磅'),
(NULL,33,258,'15x15cm/适合4-5人分享/含5套餐具/需提前5小时预定','1.5磅'),
(NULL,33,298,'16x16cm/适合7-8人分享/含10套餐具/需提前5小时预定','2.0磅'),
(NULL,33,458,'22x22cm/适合3-4人分享/含15套餐具/需提前5小时预定','3.0磅'),
(NULL,33,558,'27x27cm/适合15-20人分享/含20套餐具/需提前5小时预定','5.0磅'),
(NULL,34,198,'12x12cm/适合3-4人分享/含5套餐具/需提前5小时预定','1.0磅'),
(NULL,34,258,'15x15cm/适合4-5人分享/含5套餐具/需提前5小时预定','1.5磅'),
(NULL,34,298,'16x16cm/适合7-8人分享/含10套餐具/需提前5小时预定','2.0磅'),
(NULL,34,458,'22x22cm/适合3-4人分享/含15套餐具/需提前5小时预定','3.0磅'),
(NULL,34,558,'27x27cm/适合15-20人分享/含20套餐具/需提前5小时预定','5.0磅'),
(NULL,35,198,'12x12cm/适合3-4人分享/含5套餐具/需提前5小时预定','1.0磅'),
(NULL,35,258,'15x15cm/适合4-5人分享/含5套餐具/需提前5小时预定','1.5磅'),
(NULL,35,298,'16x16cm/适合7-8人分享/含10套餐具/需提前5小时预定','2.0磅'),
(NULL,35,458,'22x22cm/适合3-4人分享/含15套餐具/需提前5小时预定','3.0磅'),
(NULL,35,558,'27x27cm/适合15-20人分享/含20套餐具/需提前5小时预定','5.0磅'),
(NULL,36,198,'12x12cm/适合3-4人分享/含5套餐具/需提前5小时预定','1.0磅'),
(NULL,36,258,'15x15cm/适合4-5人分享/含5套餐具/需提前5小时预定','1.5磅'),
(NULL,36,298,'16x16cm/适合7-8人分享/含10套餐具/需提前5小时预定','2.0磅'),
(NULL,36,458,'22x22cm/适合3-4人分享/含15套餐具/需提前5小时预定','3.0磅'),
(NULL,36,558,'27x27cm/适合15-20人分享/含20套餐具/需提前5小时预定','5.0磅'),
(NULL,37,198,'12x12cm/适合3-4人分享/含5套餐具/需提前5小时预定','1.0磅'),
(NULL,37,258,'15x15cm/适合4-5人分享/含5套餐具/需提前5小时预定','1.5磅'),
(NULL,37,298,'16x16cm/适合7-8人分享/含10套餐具/需提前5小时预定','2.0磅'),
(NULL,37,458,'22x22cm/适合3-4人分享/含15套餐具/需提前5小时预定','3.0磅'),
(NULL,37,558,'27x27cm/适合15-20人分享/含20套餐具/需提前5小时预定','5.0磅'),
(NULL,38,198,'12x12cm/适合3-4人分享/含5套餐具/需提前5小时预定','1.0磅'),
(NULL,38,258,'15x15cm/适合4-5人分享/含5套餐具/需提前5小时预定','1.5磅'),
(NULL,38,298,'16x16cm/适合7-8人分享/含10套餐具/需提前5小时预定','2.0磅'),
(NULL,38,458,'22x22cm/适合3-4人分享/含15套餐具/需提前5小时预定','3.0磅'),
(NULL,38,558,'27x27cm/适合15-20人分享/含20套餐具/需提前5小时预定','5.0磅'),
(NULL,39,198,'12x12cm/适合3-4人分享/含5套餐具/需提前5小时预定','1.0磅'),
(NULL,39,258,'15x15cm/适合4-5人分享/含5套餐具/需提前5小时预定','1.5磅'),
(NULL,39,298,'16x16cm/适合7-8人分享/含10套餐具/需提前5小时预定','2.0磅'),
(NULL,39,458,'22x22cm/适合3-4人分享/含15套餐具/需提前5小时预定','3.0磅'),
(NULL,39,558,'27x27cm/适合15-20人分享/含20套餐具/需提前5小时预定','5.0磅'),
(NULL,40,198,'12x12cm/适合3-4人分享/含5套餐具/需提前5小时预定','1.0磅'),
(NULL,40,258,'15x15cm/适合4-5人分享/含5套餐具/需提前5小时预定','1.5磅'),
(NULL,40,298,'16x16cm/适合7-8人分享/含10套餐具/需提前5小时预定','2.0磅'),
(NULL,40,458,'22x22cm/适合3-4人分享/含15套餐具/需提前5小时预定','3.0磅'),
(NULL,40,558,'27x27cm/适合15-20人分享/含20套餐具/需提前5小时预定','5.0磅'),
(NULL,41,198,'12x12cm/适合3-4人分享/含5套餐具/需提前5小时预定','1.0磅'),
(NULL,41,258,'15x15cm/适合4-5人分享/含5套餐具/需提前5小时预定','1.5磅'),
(NULL,41,298,'16x16cm/适合7-8人分享/含10套餐具/需提前5小时预定','2.0磅'),
(NULL,41,458,'22x22cm/适合3-4人分享/含15套餐具/需提前5小时预定','3.0磅'),
(NULL,41,558,'27x27cm/适合15-20人分享/含20套餐具/需提前5小时预定','5.0磅'),
(NULL,42,198,'12x12cm/适合3-4人分享/含5套餐具/需提前5小时预定','1.0磅'),
(NULL,42,258,'15x15cm/适合4-5人分享/含5套餐具/需提前5小时预定','1.5磅'),
(NULL,42,298,'16x16cm/适合7-8人分享/含10套餐具/需提前5小时预定','2.0磅'),
(NULL,42,458,'22x22cm/适合3-4人分享/含15套餐具/需提前5小时预定','3.0磅'),
(NULL,42,558,'27x27cm/适合15-20人分享/含20套餐具/需提前5小时预定','5.0磅'),
(NULL,43,198,'12x12cm/适合3-4人分享/含5套餐具/需提前5小时预定','1.0磅'),
(NULL,43,258,'15x15cm/适合4-5人分享/含5套餐具/需提前5小时预定','1.5磅'),
(NULL,43,298,'16x16cm/适合7-8人分享/含10套餐具/需提前5小时预定','2.0磅'),
(NULL,43,458,'22x22cm/适合3-4人分享/含15套餐具/需提前5小时预定','3.0磅'),
(NULL,43,558,'27x27cm/适合15-20人分享/含20套餐具/需提前5小时预定','5.0磅'),
(NULL,44,198,'5x5cm/适合1人分享/含1套餐具/需提前5小时预定','1份'),
(NULL,45,258,'5x5cm/适合1人分享/含1套餐具/需提前5小时预定','1份'),
(NULL,46,298,'5x5cm/适合1人分享/含1套餐具/需提前5小时预定','1份'),
(NULL,47,458,'5x5cm/适合1人分享/含1套餐具/需提前5小时预定','1份'),
(NULL,48,558,'5x5cm/适合1人分享/含1套餐具/需提前5小时预定','1份'),
(NULL,49,198,'5x5cm/适合1人分享/含1套餐具/需提前5小时预定','1份'),
(NULL,50,258,'5x5cm/适合1人分享/含1套餐具/需提前5小时预定','1份'),
(NULL,1,38,'5x5cm/适合1人分享/含1套餐具/需提前5小时预定','大杯'),
(NULL,1,35,'5x5cm/适合1人分享/含1套餐具/需提前5小时预定','中杯'),
(NULL,1,42,'5x5cm/适合1人分享/含1套餐具/需提前5小时预定','超大杯'),
(NULL,2,38,'5x5cm/适合1人分享/含1套餐具/需提前5小时预定','大杯'),
(NULL,2,35,'5x5cm/适合1人分享/含1套餐具/需提前5小时预定','中杯'),
(NULL,2,42,'5x5cm/适合1人分享/含1套餐具/需提前5小时预定','超大杯'),
(NULL,3,38,'5x5cm/适合1人分享/含1套餐具/需提前5小时预定','大杯'),
(NULL,3,35,'5x5cm/适合1人分享/含1套餐具/需提前5小时预定','中杯'),
(NULL,3,42,'5x5cm/适合1人分享/含1套餐具/需提前5小时预定','超大杯'),
(NULL,4,38,'5x5cm/适合1人分享/含1套餐具/需提前5小时预定','大杯'),
(NULL,4,35,'5x5cm/适合1人分享/含1套餐具/需提前5小时预定','中杯'),
(NULL,4,42,'5x5cm/适合1人分享/含1套餐具/需提前5小时预定','超大杯'),
(NULL,5,38,'5x5cm/适合1人分享/含1套餐具/需提前5小时预定','大杯'),
(NULL,5,35,'5x5cm/适合1人分享/含1套餐具/需提前5小时预定','中杯'),
(NULL,5,42,'5x5cm/适合1人分享/含1套餐具/需提前5小时预定','超大杯'),
(NULL,6,38,'5x5cm/适合1人分享/含1套餐具/需提前5小时预定','大杯'),
(NULL,6,35,'5x5cm/适合1人分享/含1套餐具/需提前5小时预定','中杯'),
(NULL,6,42,'5x5cm/适合1人分享/含1套餐具/需提前5小时预定','超大杯'),
(NULL,7,38,'5x5cm/适合1人分享/含1套餐具/需提前5小时预定','大杯'),
(NULL,7,35,'5x5cm/适合1人分享/含1套餐具/需提前5小时预定','中杯'),
(NULL,7,42,'5x5cm/适合1人分享/含1套餐具/需提前5小时预定','超大杯'),
(NULL,8,38,'5x5cm/适合1人分享/含1套餐具/需提前5小时预定','大杯'),
(NULL,8,35,'5x5cm/适合1人分享/含1套餐具/需提前5小时预定','中杯'),
(NULL,8,42,'5x5cm/适合1人分享/含1套餐具/需提前5小时预定','超大杯'),
(NULL,9,38,'5x5cm/适合1人分享/含1套餐具/需提前5小时预定','大杯'),
(NULL,9,35,'5x5cm/适合1人分享/含1套餐具/需提前5小时预定','中杯'),
(NULL,9,42,'5x5cm/适合1人分享/含1套餐具/需提前5小时预定','超大杯'),
(NULL,10,38,'5x5cm/适合1人分享/含1套餐具/需提前5小时预定','大杯'),
(NULL,10,35,'5x5cm/适合1人分享/含1套餐具/需提前5小时预定','中杯'),
(NULL,10,42,'5x5cm/适合1人分享/含1套餐具/需提前5小时预定','超大杯'),
(NULL,11,38,'5x5cm/适合1人分享/含1套餐具/需提前5小时预定','大杯'),
(NULL,11,35,'5x5cm/适合1人分享/含1套餐具/需提前5小时预定','中杯'),
(NULL,11,42,'5x5cm/适合1人分享/含1套餐具/需提前5小时预定','超大杯'),
(NULL,12,38,'5x5cm/适合1人分享/含1套餐具/需提前5小时预定','大杯'),
(NULL,12,35,'5x5cm/适合1人分享/含1套餐具/需提前5小时预定','中杯'),
(NULL,12,42,'5x5cm/适合1人分享/含1套餐具/需提前5小时预定','超大杯'),
(NULL,13,38,'5x5cm/适合1人分享/含1套餐具/需提前5小时预定','大杯'),
(NULL,13,35,'5x5cm/适合1人分享/含1套餐具/需提前5小时预定','中杯'),
(NULL,13,42,'5x5cm/适合1人分享/含1套餐具/需提前5小时预定','超大杯'),
(NULL,14,38,'5x5cm/适合1人分享/含1套餐具/需提前5小时预定','大杯'),
(NULL,14,35,'5x5cm/适合1人分享/含1套餐具/需提前5小时预定','中杯'),
(NULL,14,42,'80g/适合1人分享/含1套餐具/需提前5小时预定','超大杯'),
(NULL,15,38,'80g/适合1人分享/含1套餐具/需提前5小时预定','盒'),
(NULL,16,35,'80g/适合1人分享/含1套餐具/需提前5小时预定','盒'),
(NULL,17,42,'80g/适合1人分享/含1套餐具/需提前5小时预定','盒');
/*插入会员精选区的数据*/ 
INSERT INTO xbk_discuss VALUES
(NULL,"十一月刊·榴莲",'11月11日','liulian.jpg'),
(NULL,"十月刊·冰激凌",'10月1日','bingjiling.jpg'),
(NULL,"九月刊·芒果",'9月18日','mangguo.jpg'),
(NULL,"八月刊·奶酪",'8月8日','nainao.jpg'),
(NULL,"七月刊·茉莉",'7月21日','moli.jpg'),
(NULL,"六月刊·啤酒",'6月15日','pijiu.jpg');







